#+title: Configuration files for my machines
#+author: Pierre-Antoine Comby
#+startup: show2levels indent

#+property: header-args: :comments both :tangle-mode (identity #o444) :mkdirp yes

#+name: tangle-remote
#+begin_src emacs-lisp :noweb true :results nil
(defun tangle-remote (name &optional host sudo)
  (cond ((file-remote-p (buffer-file-name))
         (let* ((tramp-con (tramp-dissect-file-name (buffer-file-name)))
                (tramp-home (tramp-get-home-directory tramp-con))
                (tramp-host (tramp-file-name-host tramp-con)))
           (when (or (not host) (string= tramp-host host))
             (expand-file-name (format "/sshx:%s:%s/%s" tramp-host tramp-home name)))))
        ((or (not host) (string= host system-name)) (expand-file-name name (getenv "HOME")))
        (t nil))
  )
#+end_src

#+RESULTS: tangle-remote
: tangle-remote

#+name: eval-elisp
#+begin_src emacs-lisp :var str="()"
(eval (car (read-from-string str)))
#+end_src


** A few tips

Adding this to the top of the file, ensure that I will not modify the dotfiles directly by mistake.
#+begin_src org :exports no :tangle no
#+PROPERTY: header-args: :comments link :tangle-mode (identity #o444)
#+end_src

#+RESULTS:
: #+PROPERTY: header-args: :comments link :tangle-mode (identity #o444)

Also, to avoid to write the same header in source block for each files we can write it in the properties header of each section/subsection

For instance below in the =.bashrc=
#+begin_src org
:properties:
:header-args:bash: :tangle "~/.bashrc"
:end:
#+end_src

